{
  "config": {
    "step": {
      "user": {
        "title": "Bermuda BLE Trilateration",
        "description": "Αν χρειάζεστε βοήθεια για τη διαμόρφωση, ρίξτε μια ματιά στη σελίδα [GitHub](https://github.com/agittins/bermuda)",
        "data": {
          "username": "Όνομα Χρήστη",
          "password": "Κωδικός Πρόσβασης"
        }
      }
    },
    "error": {
      "auth": "Το Όνομα Χρήστη/Κωδικός Πρόσβασης είναι λάθος."
    },
    "abort": {
      "single_instance_allowed": "Επιτρέπεται μόνο μία μεμονωμένη εγκατάσταση."
    }
  },
  "options": {
    "error": {
      "some_active": "You have at least some active devices, this is good.",
      "no_scanners": "You need to configure some bluetooth scanners before Bermuda will have anything to work with. \nAny one of esphome bluetooth_proxy, Shelly bluetooth proxy or local bluetooth adaptor should get you started.",
      "no_devices": "No bluetooth devices are actively being reported from your scanners. \nYou will need to solve this before Bermuda can be of much help."
    },
    "step": {
      "init": {
        "title": "Bermuda configuration",
        "description": "Το Bermuda βλέπει επί του παρόντος:\n- {device_counter_active} ενεργή στις {device_counter_devices} συσκευές Bluetooth.\n- {scanner_counter_active} ενεργή στις {scanner_counter_scanners} συσκευές ανιχνευτή Bluetooth.\n\n{status}"
      },
      "globalopts": {
        "title": "Global settings",
        "data": {
          "max_area_radius": "Μέγιστη ακτίνα σε μέτρα για απλή ανίχνευση ΠΕΡΙΟΧΗΣ",
          "max_velocity": "Μέγιστη Ταχύτητα σε μέτρα ανά δευτερόλεπτο - αγνοεί μετρήσεις που υποδεικνύουν απομάκρυνση πιο γρήγορη από αυτό το όριο. 3m/s (10km/h) είναι καλό.",
          "devtracker_nothome_timeout": "Χρονικό όριο Devtracker σε δευτερόλεπτα για να θεωρηθεί μια συσκευή ως `Μη Σπίτι`.",
          "update_interval": "Διάστημα Ενημέρωσης - Πόσο συχνά (σε δευτερόλεπτα) θα ενημερώνονται οι μετρήσεις του αισθητήρα.",
          "smoothing_samples": "Δείγματα Εξομάλυνσης - πόσα δείγματα να χρησιμοποιηθούν για την εξομάλυνση των μετρήσεων απόστασης.",
          "attenuation": "Απόσβεση - Παράγοντας απόσβεσης περιβάλλοντος για υπολογισμό/βαθμονόμηση απόστασης.",
          "ref_power": "Ισχύς Αναφοράς - Προεπιλεγμένο rssi σε απόσταση 1 μέτρου, για βαθμονόμηση απόστασης.",
          "configured_devices": "Διαμορφωμένες Συσκευές - Επιλέξτε ποιες συσκευές Bluetooth ή Beacons να παρακολουθήσετε με Αισθητήρες."
        },
        "data_description": {
          "max_area_radius": "Στη λειτουργία απλής `ΠΕΡΙΟΧΗΣ`, μια συσκευή θα χαρακτηριστεί ότι βρίσκεται στην ΠΕΡΙΟΧΗ του κοντινότερου δέκτη, αν βρίσκεται εντός αυτής της ακτίνας. Εάν είναι μικρή, οι συσκευές θα εμφανιστούν ως `άγνωστες` μεταξύ των δεκτών, αλλά εάν είναι μεγάλη, οι συσκευές θα φαίνονται πάντα στην πιο κοντινή Περιοχή τους.",
          "max_velocity": "Εάν μια μέτρηση υποδεικνύει ότι μια συσκευή απομακρύνεται πιο γρήγορα από αυτό, αγνοούμε αυτήν τη μέτρηση. Οι άνθρωποι συνήθως περπατούν με 1.4m/s, ενώ αν κρατούν ψαλίδι κινούνται με 3m/s.",
          "devtracker_nothome_timeout": "Πόσο γρήγορα να χαρακτηρίζονται οι οντότητες device_tracker ως `μη σπίτι` αφού σταματήσουμε να βλέπουμε διαφημίσεις. 30 έως 300 δευτερόλεπτα είναι πιθανώς καλό.",
          "update_interval": "Η μείωση των αποστάσεων θα ενεργοποιηθεί αμέσως, αλλά η αύξηση των αποστάσεων θα περιοριστεί από αυτό το διάστημα για να μειωθεί το πόσο μεγαλώνει η βάση δεδομένων σας.",
          "smoothing_samples": "Πόσα δείγματα να ληφθούν για εξομάλυνση απόστασης. Μεγαλύτεροι αριθμοί σημαίνουν πιο αργή αύξηση της απόστασης. Η μείωση των αποστάσεων δεν επηρεάζεται. 10 ή 20 είναι καλό.",
          "attenuation": "Αφού ορίσετε την ισχύ αναφοράς στα 1 μέτρο, προσαρμόστε την απόσβεση ώστε άλλες αποστάσεις να εμφανίζονται σωστά - περισσότερο ή λιγότερο.",
          "ref_power": "Τοποθετήστε τον πιο κοινό beacon σας 1 μέτρο μακριά από τον πιο κοινό δέκτη/ανιχνευτή σας. Ρυθμίστε την ισχύ αναφοράς μέχρι ο αισθητήρας απόστασης να εμφανίζει την ελάχιστη (όχι μέση) απόσταση 1 μέτρου."
        }
      },
      "selectdevices": {
        "title": "Επιλέξτε Συσκευές",
        "description": "Επιλέξτε ποιες συσκευές θέλετε να παρακολουθήσετε. Αν δεν εμφανίζονται συσκευές παρακάτω, τότε το Bermuda δεν βλέπει δεδομένα που έρχονται από ανιχνευτές Bluetooth. Βεβαιωθείτε ότι έχετε μια συσκευή esphome ble_proxy, συσκευές Shelly με διαμορφωμένη proxy Bluetooth ή έναν τοπικό προσαρμογέα Bluetooth."
      },
      "calibration1_global": {
        "title": "Διαμόρφωση 1: Καθολική",
        "description": "Αυτό το βήμα είναι για να καθιερώσετε κάποιες καθολικές προεπιλογές για υπολογισμούς αποστάσεων.\n\n{details}\n{summary}\nΑνοίξτε για οδηγίες!{summary_end}\n\nΣε μεταγενέστερα βήματα μπορείτε να ορίσετε προσαρμογές ανά συσκευή, επομένως έχει νόημα να επιλέξετε το πιο κοινό υλικό σας ως \"αναφορά\" για αυτό το βήμα. Για παράδειγμα, αν οι περισσότεροι από τους ανιχνευτές σας είναι ESPHome σε μια συγκεκριμένη πλακέτα, τότε επιλέξτε έναν από αυτούς ως ανιχνευτή αναφοράς. Ομοίως, αν έχετε μερικά από ένα συγκεκριμένο μοντέλο Beacon, χρησιμοποιήστε έναν από αυτούς ως συσκευή αναφοράς.\n\n- Επιλέξτε μια συσκευή και έναν ανιχνευτή παρακάτω για χρήση ως \"αναφορά\"\n- Τοποθετήστε φυσικά την επιλεγμένη συσκευή 1 μέτρο (ένα μέτρο) από τον επιλεγμένο ανιχνευτή. Βεβαιωθείτε ότι έχουν καθαρή οπτική επαφή μεταξύ τους και αποφύγετε να τα έχετε κοντά σε οργανικές μορφές ζωής που μπορεί να επηρεάσουν το σήμα.\n- Κάντε κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ' και σημειώστε τις τιμές RSSI στον πίνακα που θα εμφανιστεί παρακάτω. Μπορείτε να κάνετε κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ' οποιαδήποτε στιγμή για να ανανεώσετε τις τιμές.\n- Αφού σταθεροποιηθεί η ισχύς σήματος, τοποθετήστε αυτή την τιμή στο πεδίο `reference_power` και κάντε κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ'.\n- Θα πρέπει τώρα να δείτε τις ενημερωμένες τιμές και οι εκτιμώμενες αποστάσεις θα πρέπει να πλησιάζουν στο 1 μέτρο. Επαναλάβετε όπως χρειάζεται μέχρι να είστε ικανοποιημένοι με το αποτέλεσμα.\n- Στη συνέχεια, μετακινήστε τη συσκευή ώστε να βρίσκεται πιο μακριά από τον ανιχνευτή και μετρήστε αυτήν την απόσταση με μέτρο. Π.χ., 5 μέτρα μπορεί να είναι καλή απόσταση - η ακριβής απόσταση δεν έχει σημασία, αλλά η καθαρή οπτική επαφή είναι σημαντική.\n- Με τη συσκευή στη νέα απόσταση, κάντε κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ' ξανά και οι πιο πρόσφατες μετρήσεις θα πρέπει να αντικατοπτρίζουν τη νέα απόσταση, πιθανώς με κάποια ανακρίβεια.\n- Πειραματιστείτε με διαφορετικές τιμές `attenuation` και κάνοντας κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ', μέχρι να αποκτήσετε εκτιμώμενες αποστάσεις που να συμφωνούν με τη φυσική μέτρηση.\n- Αφού είστε ικανοποιημένοι με τη διαμόρφωση, επιλέξτε 'Αποθήκευση και Κλείσιμο' και κάντε κλικ στο 'ΥΠΟΒΑΛΛΕΤΕ'.\n{details_end}\n{suffix}",
        "data": {
          "configured_devices": "Συσκευή",
          "configured_scanners": "Ανιχνευτής",
          "save_and_close": "Αποθήκευση και Κλείσιμο",
          "attenuation": "Απόσβεση",
          "ref_power": "Ισχύς Αναφοράς"
        },
        "data_description": {
          "save_and_close": "Αφού είστε ικανοποιημένοι με τη διαμόρφωση, επιλέξτε αυτό το πλαίσιο και κάντε κλικ στο Υποβολή. Οι αλλαγές σας θα αποθηκευτούν και θα μπορείτε να προχωρήσετε στο επόμενο βήμα διαμόρφωσης. Αφήστε το πλαίσιο μη επιλεγμένο ενώ ρυθμίζετε και δοκιμάζετε τις ρυθμίσεις.",
          "attenuation": "Αφού ρυθμίσετε τις παραπάνω ρυθμίσεις για 1 μέτρο, μετακινήστε τη συσκευή πιο μακριά (π.χ. 5 μέτρα) και προσαρμόστε την απόσβεση μέχρι να αντιστοιχούν οι υπολογισμένες αποστάσεις με τη φυσική απόσταση μεταξύ του ανιχνευτή και της συσκευής. Κάντε κλικ στην υποβολή για να δείτε τις νέες εκτιμήσεις απόστασης.",
          "ref_power": "Για τη βαθμονόμηση αυτής της ρύθμισης, τοποθετήστε τη συσκευή 1 μέτρο από τον ανιχνευτή και ρυθμίστε την τιμή μέχρι να αντικατοπτρίζεται η απόσταση του 1 μέτρου. Λάβετε υπόψη ότι οι τιμές θα ανανεωθούν μόνο μετά το κλικ στην υποβολή και μια πιο αρνητική τιμή θα μειώσει την απόσταση."
        }
      },
      "calibration2_scanners": {
        "title": "Διαμόρφωση 2: Αντισταθμίσεις RSSI ανά Ανιχνευτή",
        "description": "Αυτό το βήμα είναι προαιρετικό αλλά χρήσιμο αν οι ανιχνευτές σας έχουν διαφορετική ευαισθησία ή διαφορετική απόδοση κεραίας. Προσαρμόστε την αντιστάθμιση rssi για κάθε ανιχνευτή μέχρι να αντιστοιχεί η υπολογισμένη απόσταση στη συσκευή αναφοράς. Αφήστε τον ανιχνευτή που χρησιμοποιήσατε ως \"αναφορά\" στο βήμα 1 στο Μηδέν.\n\n{suffix}",
        "data": {
          "configured_devices": "Συσκευή",
          "save_and_close": "Αποθήκευση και Κλείσιμο",
          "scanner_info": "Αντισταθμίσεις RSSI ανά Ανιχνευτή"
        },
        "data_description": {
          "scanner_info": "Αφήστε το στο μηδέν για να δεχτείτε την καθολική προεπιλογή ή εισάγετε έναν αριθμό μηδέν για να αντισταθμίσετε το rssi που αναφέρει αυτός ο ανιχνευτής. Προσαρμόστε μέχρι η εκτιμώμενη απόσταση παραπάνω να αντιστοιχεί στην πραγματική απόσταση μεταξύ του ανιχνευτή και της επιλεγμένης συσκευής. Αρνητικές τιμές θα αυξήσουν την απόσταση, θετικές θα τη μειώσουν."
        }
      }
    }
  },
  "entity": {
    "sensor": {
      "distance": {
        "name": "Απόσταση"
      },
      "area": {
        "name": "Περιοχή"
      }
    }
  },
  "services": {
    "dump_devices": {
      "name": "Εξαγωγή Συσκευών",
      "description": "Επιστρέφει την εσωτερική δομή δεδομένων, προαιρετικά περιορισμένη στις συγκεκριμένες διευθύνσεις. Περιλαμβάνει το rssi και άλλες πληροφορίες από κάθε ανιχνευτή.",
      "fields": {
        "addresses": {
          "name": "Διευθύνσεις",
          "description": "Μια προαιρετική λίστα διευθύνσεων MAC χωρισμένη με κενά για επιστροφή πληροφοριών. Αν αφεθεί κενό, επιστρέφονται όλες οι διευθύνσεις."
        },
        "configured_devices": {
          "name": "Διαμορφωμένες Συσκευές",
          "description": "Επιλέξτε να συμπεριλάβετε μόνο ανιχνευτές και διαμορφωμένες συσκευές στην έξοδο."
        },
        "redact": {
          "name": "Απόκρυψη",
          "description": "Ορίστε στο TRUE για να αποκρυφθούν οι διευθύνσεις MAC στην έξοδο για την προστασία της ιδιωτικότητας."
        }
      }
    }
  }
}
