{
  "config": {
    "step": {
      "user": {
        "title": "Bermuda BLE Trilateration",
        "description": "If you need help with the configuration have a look at our [GitHub page](https://github.com/agittins/bermuda)",
        "data": {
          "username": "Username",
          "password": "Password"
        }
      }
    },
    "error": {
      "auth": "Username/Password is wrong."
    },
    "abort": {
      "single_instance_allowed": "Only a single instance is allowed."
    }
  },
  "options": {
    "error": {
      "some_active": "You have at least some active devices, this is good.",
      "no_scanners": "You need to configure some bluetooth scanners before Bermuda will have anything to work with. \nAny one of esphome bluetooth_proxy, Shelly bluetooth proxy or local bluetooth adaptor should get you started.",
      "no_devices": "No bluetooth devices are actively being reported from your scanners. \nYou will need to solve this before Bermuda can be of much help."
    },
    "step": {
      "init": {
        "title": "Configure Bermuda",
        "description": "Bermuda can currently see:\n- {device_counter_active} active out of {device_counter_devices} bluetooth devices.\n- {scanner_counter_active} active out of {scanner_counter_scanners} bluetooth scanner devices.\n\n{status}"
      },
      "globalopts": {
        "title": "Global settings",
        "data": {
          "max_area_radius": "Max radius in metres for simple AREA detection",
          "max_velocity": "Max Velocity in metres per second - ignore readings that imply movement away faster than this limit. 3m/s (10km/h) is good.",
          "devtracker_nothome_timeout": "Devtracker Timeout in seconds to consider a device as `Not Home`.",
          "update_interval": "Update Interval - How often (in seconds) to update sensor readings.",
          "smoothing_samples": "Smoothing Samples - how many samples to use for smoothing distance readings.",
          "attenuation": "Attenuation - Environment attenuation factor for distance calculation/calibration.",
          "ref_power": "Reference Power - Default rssi at 1 metre distance, for distance calibration.",
          "configured_devices": "Configured Devices - Select which Bluetooth devices or Beacons to track with Sensors."
        },
        "data_description": {
          "max_area_radius": "In the simple `AREA` feature, a device will be marked as being in the AREA of it's closest receiver, if inside this radius. If you set it small, devices will go to `unknown` between receivers, but if large devices will always appear as in their closest Area.",
          "max_velocity": "If a reading implies a device is moving away faster than this, we ignore that reading. Humans normally walk at 1.4m/s, if they're holding scissors they move at 3m/s.",
          "devtracker_nothome_timeout": "How quickly to mark device_tracker entities as `not_home` after we stop seeing advertisements. 30 to 300 seconds is probably good.",
          "update_interval": "Shortening distances will still trigger immediately, but increasing distances will be rate limited by this to reduce how much your database grows.",
          "smoothing_samples": "How many samples to average distance smoothing. Bigger numbers make for slower distance increases. Shortening distances are not affected. 10 or 20 seems good.",
          "attenuation": "After setting ref_power at 1 metre, adjust attenuation so that other distances read correctly - more or less.",
          "ref_power": "Put your most-common beacon 1 metre (3.28') away from your most-common proxy / scanner. Adjust ref_power until the distance sensor shows a lowest (not average) distance of 1 metre."
        }
      },
      "selectdevices": {
        "title": "Select Devices",
        "description": "Choose which devices you wish to track. If no devices appear below, then Bermuda is not seeing any data coming from Bluetooth scanners. Ensure you have an esphome ble_proxy device, Shelly devices with bluetooth proxy configured or a local bluetooth adaptor."
      },
      "calibration1_global": {
        "title": "Calibration 1: Global",
        "description": "This step is to establish some global defaults for distance calculations.\n\n{details}\n{summary}\nExpand for instructions!{summary_end}\n\nIn later steps you can set per-device overrides, so it makes sense to choose your most common hardware as a 'reference pair' for this step. For example, if most of your scanners are ESPHome on a particular board, then choose one of those to use as the reference scanner. Likewise if you have a handful of a particular model of beacon, use one of those as your reference device.\n\n- Choose a device and a scanner below to use as your 'reference pair'\n- Physically place your chosen device at 1m (one metre) from the chosen scanner. Ensure they have a clear line of sight to each other, and avoid having them close to any organic life-forms which might interfere with the signal.\n- Click 'SUBMIT' and note the RSSI values in the table that will appear below. You can click 'SUBMIT' again at any time to refresh the values.\n- Once you have a stable signal strength, put that value into the `reference_power` field and click 'SUBMIT'.\n- You should now see the updated values, and the estimated distances should be close to 1 metre. Repeat as required until you are happy with the result.\n- Now move the device so that it is further from the scanner and measure this distance with a tape measure. Around 5 metres might be a good distance - the exact distance doesn't matter, but keeping a clear line of sight is important, and you might find longer distances will give you more accuracy, generally.\n- With the device at the new distance, click 'SUBMIT' again and you should see the most recent measurements will reflect the new distance, but will probably be inaccurate.\n- Experiment with different values for `attenuation` and clicking 'SUBMIT', until you get the estimated measurements to agree with your physical measurement.\n- Once you are happy with the calibration, tick 'Save and Close' and click 'SUBMIT'.\n{details_end}\n{suffix}",
        "data": {
          "configured_devices": "Device",
          "configured_scanners": "Scanner",
          "save_and_close": "Save and Close",
          "attenuation": "Attenuation",
          "ref_power": "Reference Power"
        },
        "data_description": {
          "save_and_close": "After you are happy with the calibration, check this box and click Submit. Your changes will be saved, and you can proceed to the next calibration step. Leave this box un-checked while you adjust and test the settings.",
          "attenuation": "After adjusting the above settings for 1m distance readings, move the device further away (for example 5 metres) and adust the attenuation until the calculated distances match the physical distance between the scanner and device. Click submit to see the new distance estimations.",
          "ref_power": "To calibrate this setting, place the device 1 metre from the scanner, and adjust the value until the figures above reflect that 1m distance. Note that values will only recompute after clicking submit, and a more-negative number will result in a lower distance"
        }
      },
      "calibration2_scanners": {
        "title": "Calibration 2: Per-Scanner RSSI Offsets",
        "description": "This step is optional but useful if your scanners have different sensitivities or varying antenna performance. Adjust the offset rssi for each scanner until the calculated distance to the selected device is correct. Leave the scanner you used in your \"reference pair\" in step 1 at Zero.\n\n{suffix}",
        "data": {
          "configured_devices": "Device",
          "save_and_close": "Save and Close",
          "scanner_info": "Per-Scanner RSSI Offsets"
        },
        "data_description": {
          "scanner_info": "Leave at zero to accept the global default, or enter a non-zero number to offset the rssi reported by that scanner. Adjust until the estimated distance above matches the actual distance between that scanner and the selected transmitting device. Negative values will increase the distance, positive values will decrease it."
        }
      }
    }
  },
  "entity": {
    "sensor": {
      "distance": {
        "name": "Distance"
      },
      "area": {
        "name": "Area"
      }
    }
  },
  "services": {
    "dump_devices": {
      "name": "Dump Devices",
      "description": "Returns the internal data structure, optionally limited to the given address(es). Includes the rssi and other info from each scanner",
      "fields": {
        "addresses": {
          "name": "Addresses",
          "description": "An optional space-separated list of MAC addresses to return info on. If blank get all addresses."
        },
        "configured_devices": {
          "name": "Configured Devices",
          "description": "Select to include only scanners and configured devices in the output."
        },
        "redact": {
          "name": "Redact",
          "description": "Set to TRUE to ensure MAC addresses are redacted in output for privacy."
        }
      }
    }
  },
  "issues": {
    "scanner_without_area": {
      "title": "Some Bluetooth Proxies don't have an AREA",
      "description": "Bermuda requires all bluetooth proxies to have a valid area assigned in order to work correctly. Assign an area by visiting each proxy's device page (via `Devices and Services`), and click the pencil icon in the top-right to assign an area. The following proxies are missing an area assignment:\n\n{scannerlist}"
    }
  }
}
