{
  "config": {
    "step": {
      "user": {
        "title": "Bermuda BLE Trilateration",
        "description": "If you need help with the configuration have a look here: https://github.com/agittins/bermuda",
        "data": {
          "username": "Username",
          "password": "Password"
        }
      }
    },
    "error": {
      "auth": "Username/Password is wrong."
    },
    "abort": {
      "single_instance_allowed": "Only a single instance is allowed."
    }
  },
  "options": {
    "step": {
      "init": {
        "description": "Bermuda can currently see {device_count} bluetooth devices, reported across {scanner_count} bluetooth scanner devices. {status}"
      },
      "globalopts": {
        "data": {
          "max_area_radius": "Max radius in metres for simple AREA detection",
          "max_velocity": "Max Velocity in metres per second - ignore readings that imply movement away faster than this limit. 3m/s (10km/h) is good.",
          "devtracker_nothome_timeout": "Devtracker Timeout in seconds to consider a device as `Not Home`.",
          "update_interval": "Update Interval - How often (in seconds) to update sensor readings.",
          "smoothing_samples": "Smoothing Samples - how many samples to use for smoothing distance readings.",
          "attenuation": "Attenuation - Environment attenuation factor for distance calculation/calibration.",
          "ref_power": "Reference Power - Default rssi at 1 metre distance, for distance calibration.",
          "configured_devices": "Configured Devices - Select which Bluetooth devices or Beacons to track with Sensors."
        },
        "data_description": {
          "max_area_radius": "In the simple `AREA` feature, a device will be marked as being in the AREA of it's closest receiver, if inside this radius. If you set it small, devices will go to `unknown` between receivers, but if large devices will always appear as in their closest Area.",
          "max_velocity": "If a reading implies a device is moving away faster than this, we ignore that reading. Humans normally walk at 1.4m/s, if they're holding scissors they move at 3m/s.",
          "devtracker_nothome_timeout": "How quickly to mark device_tracker entities as `not_home` after we stop seeing advertisements. 30 to 300 seconds is probably good.",
          "update_interval": "Shortening distances will still trigger immediately, but increasing distances will be rate limited by this to reduce how much your database grows.",
          "smoothing_samples": "How many samples to average distance smoothing. Bigger numbers make for slower distance increases. Shortening distances are not affected. 10 or 20 seems good.",
          "attenuation": "After setting ref_power at 1 metre, adjust attenuation so that other distances read correctly - more or less.",
          "ref_power": "Put your most-common beacon 1 metre (3.28') away from your most-common proxy / scanner. Adjust ref_power until the distance sensor shows a lowest (not average) distance of 1 metre."
        }
      },
      "selectdevices": {
        "title": "Select Devices",
        "description": "Choose which devices you wish to track. If no devices appear below, then Bermuda is not seeing any data coming from Bluetooth scanners. Ensure you have an esphome ble_proxy device, Shelly devices with bluetooth proxy configured or a local bluetooth adaptor."
      }
    }
  },
  "entity": {
    "sensor": {
      "distance": {
        "name": "Distance"
      },
      "area": {
        "name": "Area"
      }
    }
  },
  "services": {
    "dump_devices": {
      "name": "Dump Devices",
      "description": "Returns the internal data structure, optionally limited to the given address(es). Includes the rssi and other info from each scanner",
      "fields": {
        "addresses": {
          "name": "Addresses",
          "description": "An optional space-separated list of MAC addresses to return info on. If blank get all addresses."
        },
        "configured_devices": {
          "name": "Configured Devices",
          "description": "Select to include only scanners and configured devices in the output."
        },
        "redact": {
          "name": "Redact",
          "description": "Set to TRUE to ensure MAC addresses are redacted in output for privacy."
        }
      }
    }
  }
}
